import React, { useState, useEffect } from 'react';
import StringDisplay from '../stringDisplay/StringDisplay';
import './Blessing.css';

// הברכות שברשותך
const BlessingData = [
    {
        title: 'עדינה הנדירה!!',
        content: 'זהו הזמן הולך ודועך ומתקרב אט אט לסיומה של תקופה. תקופה מטורפת שאנחנו מאחלות לכל בחורה שהגיע לפרקה. תקופה של סיפוק, צחוקים, תובנות, שיחות עומק שנוצרו רק השנה (כמה חבל שלא מי"ב). תקופה של צמיחה ובגירה רוחנית וגשמית קבלת החלטות, קבלות, חיזוקים. תקופה של קשר חדש שהתרקם לו לא מזמן וכמה היינו משלמות שזה יקרה המון לפני כן. תקופה שכל שעובר לו הזמן נופל לנו האסימון. שזה עומד לקרות בעוד 23 ימים - מרגש ומלחיץ כאחד. שימי❤️. מעכשיו עכיוזה בפעולה לגבי משפטים, תובנות, ברכות, איחולים, חיזוקים. כל יום ביומו',
        sender: 'אוהבות- - -',
    },

    {
        title: 'עדינה המהממת!',
        content: 'אדם חכם יכול לעשות את ההחלטות שלו בעצמו. אדם בור יעקוב אחרי דעת הציבור',
        sender: 'איתך---',
    },
    // הוספת עוד ברכות עד שיהיו 23 ברכות
    {
        title: '',
        content: 'החיים הם כמו ספר. חלק מהפרקים הם עצובים, חלק שמחים וחלק מרגשים. אבל עד שלא תמשיך לדף הבא, לא תדע מה הפרק הבא טומן בחובו.',
        sender: '',
    },
    {
        title: 'עדינה,',
        content: 'נושמות איתך את ריח הפריחה. רואות לבן מול העיניים. שומעות גם מנגינה בשקט. ובינתיים. מתפללות עליך ועל כולנו. לבית מהחלומות. ושהכל יהיה ממש - דבש.',
        sender: '',
    },
    {
        title: 'עדינה שלנו,',
        content: 'היום ה-19. ואתמול עוד היה ה-20. אבל בליבנו תשארי לעולמים. את 3% רווקה. ו-97% אישה. אוהבים אותך, עדינה. אוהבים אותך – "יחתיכה". (חרוז אחרון כבר לא היה לנו...). אין דברים כאלו!!!!!',
        sender: 'אוהבות- - -',
    },
    {
        title: '',
        content: '"אם תשאל, תהיה טיפש לשנייה. אם לא תשאל, תהיה טיפש לנצח"',
        sender: 'אוהבות- - -',
    },
    {
        title: '',
        content: 'עדינה שלנו. הנה עדינה אנחנו שלשה שבועות לפני החתונה אבל הפעם על אמת!!!!.והנה את חותמת לך איזה שהוא סיום של תקופה מרגשת, לחוצה, מאתגרת.ומחר הנך ניצבת מפני אירוע רב פעילים שכל כולו מבטא ריגושים אחרונים.ואת האמת: סוג של פרידה מהתקופה הקודמת, איזה שהוא אזכור לתאריך הקרב ובא.עדינה! אנחנו לאט לאט מתחילות לקלוט שזה אמיתי, את באמת הולכת להיות כלה אמיתית שרק דמינו אותה בסרטים..זהו זה מה שיש לנו להגיד עד כה. ',
        sender: 'ביוש הדס ויהודית',
    },
    {
        title: '',
        content: 'היי עדינה. מה עניינים?. מקוות שנהנית היום. בינתיים עוד לא כתבנו ברכה להיום. בעזרת השם יבוא בהמשך. תודה ולהתראות. המשך יום קסום❤️',
        sender: '',
    },
    {
        title: '',
        content: 'היי עדינה. מה עניינים?. מקוות שנהנית היום. בינתיים עוד לא כתבנו ברכה להיום. בעזרת השם יבוא בהמשך. תודה ולהתראות. המשך יום קסום❤️',
        sender: '',
    },
    {
        title: '',
        content: 'היי עדינה. מה עניינים?. מקוות שנהנית היום. בינתיים עוד לא כתבנו ברכה להיום. בעזרת השם יבוא בהמשך. תודה ולהתראות. המשך יום קסום❤️',
        sender: '',
    },
    {
        title: '',
        content: 'עידן שלנו!.אנחנו מאד מתרגשות זה באמת עוד שניה קורה----.את קולטת שאנחנו שבועיים לפני?????.מה נשאר לנו לכתוב לך רק שיהיה לך שמחה,אושר ועושר,בריאות.את בחורה מדהימה, שמחה, זורמת, עושה שיגועים.נראה לי אנחנו מתחילות להבין שאין לנו לאן לברוח במחשבות זה כאן.ואנחנו חיבות להבין שהחתונה הולכת ומתקרבת. ואת באמת מתחילה את החיים האמיתים שלך מה שנקרא.וזה הכי מרגש בעולם!!!. אוהבות המון🩷',
        sender: '',
    },
    {
        title: '',
        content: 'עדינה שלנו.!!בעוד שבועיים, את עכשיו משפשפת עיניים.רק אתמול היתה החתונה, ואת בכלל לא מאמינה--.ערב שבת הראשונה, תכף נרות את מדליקה.וזכיני לגדל את לוחשת, עוד חוליה בשרשרת.אנחנו החברות עדיין רווקות עלייך מתפללות, גם אם לא ליד נרות.עדינה - מאחלות את הכל הטוב בעולם שרק אור יהיה בזה הבניין.תנוחי טוב בשבת כי אחריה יש רק עוד אחת---',
        sender: '',
    },
    {
        title: '',
        content: 'ויתרנו על ברכה להיום. עימך הסליחה',
        sender: '',
    },
    {
        title: '',
        content: 'מחר פגישה האחרונה לפני הרגע המיוחל, .עוד מעט החתונה, הלב כבר מאושר. זמן ליהנות, לחייך ולהתרגש,.לפני שיגיע היום המרגש.זכרי לקחת רגע קטן לנשום ולהירגע, .לחוות כל שנייה, להתרגש בלי הפסקה. פגישה אחרונה, סיום ההכנות, .עוד מעט החתונה, וכל הציפיות מתגשמות.אז תהני מכל רגע, תחווי את המסע, .בקרוב תהיי כלה, נרגשת ויפה. כל האושר והשמחה כבר באים, .זה הזמן להאיר את החיים.!!!!',
        sender: '',
    },
    {
        title: '',
        content: 'מחר פגישה האחרונה לפני הרגע המיוחל, .עוד מעט החתונה, הלב כבר מאושר. זמן ליהנות, לחייך ולהתרגש,.לפני שיגיע היום המרגש.זכרי לקחת רגע קטן לנשום ולהירגע, .לחוות כל שנייה, להתרגש בלי הפסקה. פגישה אחרונה, סיום ההכנות, .עוד מעט החתונה, וכל הציפיות מתגשמות.אז תהני מכל רגע, תחווי את המסע, .בקרוב תהיי כלה, נרגשת ויפה. כל האושר והשמחה כבר באים, .זה הזמן להאיר את החיים.!!!!',
        sender: '',
    },
    {
        title: '',
        content: 'הדירה וכל החפצים, סוףסוף יש מקום לריגושים.מפת שולחן, ארון מנורה--- בואו - זה כבר לא בדיחה!!.כמו יונה צעירה שבונה לה את הקן, ענף ועוד אחד והנה הוא מתמר---.זה השלב עדינה לבנות להשקיע, לכל פינה ופינה להגיע.עדינה,.בית זה לא מקום שישנים בו, גם לא מקום שאוכלים בו או מכבסים או מגהצים.בית זה מקום שבו חיים! אז שיהיה לכם חיים מאושרים!!! .לחיים, עד מאה ועשרים !!!',
        sender: '',
    },
    {
        title: '',
        content: 'כמה דקות והברכה באה, סבלנות!!!🩷🧡💛💚',
        sender: '',
    },
    {
        title: '',
        content: 'עדינה יקרה כל כך!.אנחנו חושבות,שהגיע השלב שאחנו חייבות לעכל שזהו הדבר הזה שנקרא "חתונה" .הולך להיות עוד שבוע-זה פשוט בלתי נתפס הידיעה הזו שהולך ומתפתחת בתוכנו.שעוד שבוע את הופכת להיות אישה והדברים שיעניינו אותך יהיו סוג הארוחת צהריים .או הכלים שמחכים לשטיפה ואין מתנדבים למשימה.סוג דברים כל כך שונים ממנו -שלא תטעי כולנוווו רוצות, מיחלות, מקוות להיות שם.כמה שיותר מהר (אווווו לשדך הבנות ולשחרור הגיבנות)אומין!!!!.זהו, נותר לנו לברך אותך שהקב"ה ישרה עליכם ויפנק אתכם ברכה עד בלי די.היה מדהים בדמיון המודרך אצלך--- . (מתחילות ללמוד את סוג הריקודים מעכשיו😊🫢🤭). אוהבות המון',
        sender: '',
    },
    {
        title: '',
        content: 'שבת אחרונה לחיי הרווקות---.איך אומרים אחינו האשכנזים? אופרוף--.מלשון אוף או עוף? נתון לשיקולך---.תנצלי אותה היטב.כי נכון שהיו ימים טובים, אבל את נכנסת בעז"ה לחיים טובים יותר!.מרגישות את ההתרגשות-- חושבות עליך מבית חלקיה. נשתדל להתחזק גם בשבילך בעניין בית של תורה 😊.גוט שאבעס שיהיה לך.',
        sender: '',
    },
    {
        title: '',
        content: '4 ימים!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!',
        sender: '',
    },
    {
        title: '',
        content: '4 ימים!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!',
        sender: '',
    },
    {
        title: '',
        content: 'הלילה שאחרי.מחשבות, תהיות, מסקנות, תובנות, מתרקמות לנו בעומק המח בלילה שאחרי.המזוודה כבר פרוקה, ואת כבר מוכנה לשינה, ואז---.כשאת במיטה עוצמת עינים.ומתחילה להעביר במח את יום שישי, שבת שעברו עלייך.מתחילה לחשוב על כמה היה כיף בשבת אך עם זאת חלל ריק שמותיר מחשבות לא נחמדות.הבנה שעוד 3 ימים החתונה של עדינה כהן!!!.תובנה שאומרת שלא היית רק מסיבות משמחות מאד,.מרגשות מאד,מקרקעות מידי!!!!.ואז תתחיל להיזכר בתוכך הסיטואציה של פרידי ותמר .רבות בסעודה שלישית האם החתונה עוד שלשה ימים או ארבעה ימים- אחד הדברים המצחיקים של החיים.זהו עדינה לבינתים---.מתרגשות איתך, שמחות איתך, מצפות איתך. 😊😀😁😍🤗😜🫠',
        sender: '',
    },
    // הוספת עוד ברכות כך שהן יתמלאו בברכות מתאימות
];

const Blessings = () => {
    const [currentBlessing, setCurrentBlessing] = useState(null);

    useEffect(() => {
        const today = new Date();
        const weddingDate = new Date(2024, 6, 3); // תאריך החתונה ב-03/07/2024
        const daysUntilWedding = Math.ceil((weddingDate - today) / (1000 * 60 * 60 * 24));
        const dayIndex = 23 - daysUntilWedding;

        if (dayIndex >= 0 && dayIndex < BlessingData.length) {
            setCurrentBlessing(BlessingData[dayIndex]);
        } else {
            setCurrentBlessing({
                title: 'אין ברכה להיום',
                content: 'נא לבדוק את התאריך או לוודא שיש ברכות מספיקות.',
                sender: ''
            });
        }
    }, []);

    return (
        <div className="blessingContainer">
            {currentBlessing && (
                <>
                    <div id="title"><StringDisplay longString={currentBlessing.title} /></div>
                    <div id="content"><StringDisplay longString={currentBlessing.content} /></div>
                    <div id="sender"><StringDisplay longString={currentBlessing.sender} /></div>
                </>
            )}
        </div>
    );
}

export default Blessings;